app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all.sort_data(params).page(params[:page]).per(25)
---
SELECT "teachers".* FROM "teachers" ORDER BY school_year desc LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "teachers"